InformationRegisters/СтоимостьУслугПоДоставкеТовараНаТТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтоимостьУслугПоДоставкеТовараНаТТ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаличиеДопТарифа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаДопТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоставкаВСетках_Удалить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаДоставкиНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыДоставкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтоимостьУслугПоДоставкеТовараНаТТ/Ext/RecordSetModule.bsl
Процедура ПроверитьДубльКонтрагентаВЗаписи(ТекЗапись, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"		, ТекЗапись.Период);
	Запрос.УстановитьПараметр("Контрагент"	, ТекЗапись.Контрагент);
	Запрос.УстановитьПараметр("ТТ"			, ТекЗапись.ТТ);
	Запрос.УстановитьПараметр("ГруппаДоставкиНоменклатуры", ТекЗапись.ГруппаДоставкиНоменклатуры);
	 
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.СтоимостьУслугПоДоставкеТовараНаТТ КАК СтоимостьУслугПоДоставкеТовараНаТТ
	|ГДЕ
	|	СтоимостьУслугПоДоставкеТовараНаТТ.Период = &Период
	|	И СтоимостьУслугПоДоставкеТовараНаТТ.ТТ = &ТТ
	|	И СтоимостьУслугПоДоставкеТовараНаТТ.ГруппаДоставкиНоменклатуры = &ГруппаДоставкиНоменклатуры
	|	И НЕ СтоимостьУслугПоДоставкеТовараНаТТ.Контрагент = &Контрагент";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Отказ = НЕ РезультатЗапроса.Пустой();
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, Замещение)
	
	//+++АК sole 2018.07.06 ИП-00019019
	Если Не ЭтотОбъект.ОбменДанными.Загрузка Тогда
	    
		НетПравНаЗапись = Не РегистрыСведений.СтоимостьУслугПоДоставкеТовараНаТТ.ПроверитьПраваНаЗапись(ЭтотОбъект.ВыгрузитьКолонку("ТТ"));
	
		Если НетПравНаЗапись Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	//---АК sole 2018.07.06 ИП-00019019
	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		//ПроверитьДубльКонтрагентаВЗаписи(ТекЗапись, Отказ);
		//Если Отказ Тогда
		//	Сообщить("Для данной ТТ и группы доставки номенклатуры уже есть запись для данного периода записи (" + Формат(ТекЗапись.Период, "ДЛФ=Д") + ")!");
		//	Продолжить;
		//КонецЕсли;
		ТекЗапись.ДатаЗаписи = ТекущаяДата();
	КонецЦикла;
	
КонецПроцедуры
